barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/hal_radio.c
/**
  ******************************************************************************
  * @file    hal_radio.c 
  * @author  William Liang
  * @version V1.0.0
  * @date    09/10/2013
  * @brief   This file contains the initialization and handle of the radio frequency.
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdlib.h>
#include "hal_radio.h"
#include "hal_uart.h"

#include "sx1276-LoRaMisc.h"
#include "sx1276-LoRa.h"
#include "hal_timer.h"
#include "stm32f0xx_spi.h"
#include "phy.h"
#include "sx1276-Fsk.h"
#include "hal_led.h"
#include "gpio_per.h" 

//#include "hal_fsk_sen.h"
//#include "MAC.h"
//#include "sx1276.h"
//#include "hal_flash.h"
//#include "hal_wdg.h"
//#include "hal_eeprom.h"


typedef enum
{
  START_645_POINT       = 0,
  ADDR_645_POINT        = 1,
  CONTROL_645_POINT     = 8,
  DATA_LENGTH_645_POINT = 9,
  DATA_MARK_645_POINT   = 10,
  DATA_PACKET_645_POINT = 14
}em_645_point;


/** @addtogroup RADIO
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/


extern sRF_FSK g_fsk ;
extern st_RF_LoRa_DypeDef g_RF_LoRa;
extern RN8209C_PARAM rn8209c_papameter;
extern u8 tedtbuf[];

struct etimer timer_rf; 

/*
u8 local_addr[6]    = {0x0b, 0x9a, 0x09, 0x03, 0x00, 0x11};
u8 bordcast_addr[6] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};

u8 cmd_op_light[4]  = {0x34, 0x33, 0x33, 0x93};
u8 cmd_read_data[4] = {0x42, 0x33, 0x33, 0x94};
*/


/*****************************************************************************
由参数传递数据，PHY_data_indication定义在NWK层，
但是由PHY层调用，PHY_data_indication定义中表明需要的数据由PHY层由参数提供
******************************************************************************/
void PHY_data_indication(u8 * buf, u16 length)
{
    //NWK_data_indication(buf, length);
}


/*****************************************************************************
 Prototype    : hal_RF_process
 Description  : 无线驱动进程
 Date         : 2014/3/15
 Author       : Barry
*****************************************************************************/
/* 尽量将etimer 绑定在事件中，在事件中定义 */
PROCESS(hal_RF_process, "radio_process ");

#ifdef USE_LORA_MODE
PROCESS_THREAD(hal_RF_process, ev, data)
{
  PROCESS_BEGIN();
  
  while(1)
  {
    PROCESS_WAIT_EVENT(); 

    if (ev == PROCESS_EVENT_MSG)
    {
        if (*((tRFLRStates*)data) == RFLR_STATE_TX_RUNNING)   
        {
            etimer_set(&timer_rf, CLOCK_CONF_SECOND*4);                 //超时时间还需要调整
            printf("tx start\r\n");
        }
        else if (*((tRFLRStates*)data) == RFLR_STATE_TX_DONE)  
        {
           //etimer_stop(&timer_rf);                                    //此处如果不在中断函数中处理，就要在进程函数中处理
           SX1276LoRa_Receive_Packet(false);
           printf("tx done\r\n");
        }
        else  if (*((tRFLRStates*)data) == RFLR_STATE_RX_RECEIVEING) 
        {
           etimer_set(&timer_rf, CLOCK_CONF_SECOND*4);                  //超时时间还需要调整
           printf("rx start\r\n");
        } 
        else if (*((tRFLRStates*)data) == RFLR_STATE_RX_ERR)
        {
           SX1276LoRa_Receive_Packet(false); 
           printf("CRC error\r\n");
        }
        else if (*((tRFLRStates*)data) == RFLR_STATE_RX_DONE) 
        {
           SX1276LoRa_Receive_Packet(false); 
           
           printf("rssi = %f  snr = %d\r\n",SX1276LoRaGetPacketRssi(), SX1276LoRaGetPacketSnr());
           
           for (u8 i = 0; i < g_RF_LoRa.rf_RxPacketSize; i++)
           {
              printf("%X ",g_RF_LoRa.rf_DataBuffer[i]);
           }
           printf("\r\n");
         
          if (g_RF_LoRa.rf_DataBufferValid)
          {
              //etimer_stop(&timer_rf);                                 //此处如果不在中断函数中处理，就要在进程函数中处理
              hal_ToggleLED(TXD_LED);
              g_RF_LoRa.rf_DataBufferValid = false;
          }
        }
    }
    else if (ev == PROCESS_EVENT_TIMER)
    {
       if ((struct etimer *)data == &timer_rf)
       {
         if (SX1276LoRaGetRFState() == RFLR_STATE_TX_RUNNING)   
         {
            printf("tx time out\r\n");
         }
         if (SX1276LoRaGetRFState() ==  RFLR_STATE_RX_RECEIVEING)
         {
            printf("rx time out\r\n");
         }  
         hal_sRF_InitSPI();
         SX1276LoRa_Receive_Packet(false);
       }
    }
 }
 PROCESS_END();
}
#else
  
PROCESS_THREAD(hal_RF_process, ev, data)
{
  PROCESS_BEGIN();

  while(1)
  {
    PROCESS_WAIT_EVENT(); 

    if (ev == PROCESS_EVENT_MSG)
    {
        if (*((tRFStates*)data) == RF_STATE_TX_RUNNING)   
        {
            printf("tx start\r\n");
        }
        else if (*((tRFStates*)data) == RF_STATE_TX_DONE)  
        {
           printf("tx done\r\n");
           SX1276Fsk_recrive_Packet();
        }
        else  if (*((tRFStates*)data) == RF_STATE_RX_PREAMBLE) 
        {
            printf("rx start\r\n");
            etimer_set(&timer_rf, CLOCK_CONF_SECOND*4);
        }
        else if (*((tRFStates*)data) == RF_STATE_RX_DONE) 
        {
           printf("rx done\r\n");
           printf("rssi = %f\r\n",g_fsk.rssi);
           for (u8 i = 0; i < g_fsk.packetLenth; i++ )
           {
              printf("%d ",g_fsk.buffer[i]);
           }
           printf("\r\n");
           SX1276Fsk_recrive_Packet();
        }
    }
    else if (ev == PROCESS_EVENT_TIMER)
    {
         if ((struct etimer *)data == &timer_rf)
         {
           if (g_fsk.states == RF_STATE_TX_RUNNING)   
           {
              printf("tx time out\r\n");
           }
           else
           {
              hal_sRF_InitSPI();
              SX1276Fsk_recrive_Packet();
              printf("rx time out\r\n");
           }  
         }
       
